{
    "vulnerabilities": [
      {
        "name": "SQL Injection",
        "clue": "An attack technique that exploits inadequate validation of user input in SQL queries, allowing attackers to manipulate a database.",
        "link": "https://en.wikipedia.org/wiki/SQL_injection"
      },
      {
        "name": "Cross-Site Scripting (XSS)",
        "clue": "A vulnerability that allows attackers to inject malicious scripts into web pages viewed by other users.",
        "link": "https://en.wikipedia.org/wiki/Cross-site_scripting"
      },
      {
        "name": "Buffer Overflow",
        "clue": "In this attack the attacker alters the application’s execution path and overwrites elements of its memory, which amends the program’s execution path to damage existing files or expose data.",
        "link": "https://en.wikipedia.org/wiki/Buffer_overflow"
      },
      {
        "name": "Remote Code Execution",
        "clue": "An vulnerability in which an attacker is able to run any commands or code of the their choice on a target machine or in a target process.",
        "link": "https://en.wikipedia.org/wiki/Arbitrary_code_execution"
      },
      {
        "name": "Denial of Service",
        "clue": "An attack that aims to overwhelm a system, network, or service to render it unavailable to users.",
        "link": "https://en.wikipedia.org/wiki/Denial-of-service_attack"
      },
      {
        "name": "Man in the Middle Attack",
        "clue": "An attack where an attacker intercepts communication between two parties without their knowledge, potentially eavesdropping or altering data.",
        "link": "https://en.wikipedia.org/wiki/Man-in-the-middle_attack"
      },
      {
        "name": "Arbitrary code execution",
        "clue": "This is an attacker's ability to run any commands or code of the attacker's choice on a target machine or in a target process",
        "link": "https://en.wikipedia.org/wiki/Arbitrary_code_execution"
      },
      {
        "name": "XXE Injection",
        "clue": "A vulnerability that allows an attacker to exploit insecure XML parsers to disclose internal files, execute remote requests, or launch a DoS attack.",
        "link": "https://en.wikipedia.org/wiki/XML_external_entity_attack"
      },
      {
        "name": "Server Side Request Forgery",
        "clue": "A vulnerability that enables attackers to make unauthorized requests from a vulnerable server, potentially accessing internal resources or services.",
        "link": "https://en.wikipedia.org/wiki/Server-side_request_forgery"
      },
      {
        "name": "Path Traversal",
        "clue": "A vulnerability that allows attackers to access files and directories outside the intended directory, potentially disclosing sensitive information.",
        "link": "https://en.wikipedia.org/wiki/Directory_traversal_attack"
      },
      {
        "name": "Clickjacking",
        "clue": "An attack where a malicious website or element is positioned over a legitimate site to trick users into clicking on something different from what they see.",
        "link": "https://en.wikipedia.org/wiki/Clickjacking"
      },
      {
        "name": "Session Fixation",
        "clue": "An attack where an attacker sets a user's session identifier to a known value, potentially allowing unauthorized access to the user's account.",
        "link": "https://en.wikipedia.org/wiki/Session_fixation"
      },
      {
        "name": "Cryptographic Side Channel Attacks",
        "clue": "A class of vulnerabilities where attackers exploit information leaked by cryptographic implementations, such as timing or power consumption.",
        "link": "https://en.wikipedia.org/wiki/Side-channel_attack"
      },
      {
        "name": "Race Conditions",
        "clue": "A class of vulnerabilities that occur when multiple processes access shared data simultaneously, leading to unintended consequences.",
        "link": "https://en.wikipedia.org/wiki/Race_condition"
      },
      {
        "name": "Zero Day Vulnerability",
        "clue": "A previously unknown security flaw in software or hardware that is exploited by attackers before the vendor has a chance to develop and release a patch.",
        "link": "https://en.wikipedia.org/wiki/Zero-day_(computing)"
      },
      {
        "name": "Brute Force Attack",
        "clue": "An attack where an attacker systematically tries all possible combinations to guess a user's password or encryption key.",
        "link": "https://en.wikipedia.org/wiki/Brute-force_attack"
      },
      {
        "name": "Data Breach",
        "clue": "An incident where sensitive or confidential data is exposed to unauthorized users, often resulting in harm to individuals or organizations.",
        "link": "https://en.wikipedia.org/wiki/Data_breach"
      },
      {
        "name": "Biometric Vulnerabilities",
        "clue": "Vulnerabilities related to the use of biometric authentication methods, including fingerprint and facial recognition, that can be exploited by attackers.",
        "link": "https://en.wikipedia.org/wiki/Biometrics"
      },
      {
        "name": "Supply Chain Attacks",
        "clue": "Attacks that target the software supply chain, compromising the integrity of software or hardware components before they reach the end user.",
        "link": "https://en.wikipedia.org/wiki/Supply_chain_attack"
      },
      {
        "name": "Software Composition",
        "clue": "Vulnerabilities stemming from insecure third-party software components used in an application, which can introduce security flaws.",
        "link": "https://en.wikipedia.org/wiki/Software_composition_analysis"
      }
    ]
  }
  